{
  "content": "\n%HEADER%\n\nThis is the body. There are a few tags you should know about:\n\nThe %GROUP% tag simply indicates the name of the group being graded. It is the\nsame as the values shown in the feedback lists.\n\nThe %GRADE% tag indicates the grade of the group. It must be one of the possible\ngrades for the task, or \"Not set\", which is the default value.\n\nThe %MANUAL% tag indicates that some part of the template (it may also be\npresent in Pasta) is not to be exported as-is. For example, it may include code\nsnippets that should be altered to fit the current group being graded. This is\nthe ONLY tag which will not be removed when exporting.\n\nThe %FILE: <Filename>% tag is special. It can be used to give feedback\nreferencing an appropriate row and file (and column, if you like). If you did\nnot use the automatic import function (Ctrl+I), files can be dragged-and-dropped\nonto the file view of a group to add it. \n\nAbout files:\n================================================================================\n<><><><><><><><><><><><><><><><> Main.java  <><><><><><><><><><><><><><><><><><>\n================================================================================\n%FILE:  Main.java  % <-- This is a file tag. \n\nThis is what an automatic file section looks like (the width, currently 80, can\nbe changed in the settings). It will be created the the bottom of the document\nif no footer tag is present. The tags are created automatically if they are not\npresent when a file related function is called.\n\n%FOOTER%\n",
  "header": "Hello! This is the header.\n\nThis is usally a good place to put information which doesn't change between\nassignments, such as grading policy. I'm gonna use it to tell you about some\nfeatures instead:\n\nImport a template (Feedback -> Import Template), but not quite yet. It will\nreplace what you're reading now.\n\nImport groups from folder structures\n    1. A single root folder is assumed to contain a one folder per\n       group. Any subfolders of top-level subfolders will be group property.\n    2. Set file filters (e.g. java) to select the types of files to import.\n    3. Click done or close the window. The program will ask you if you want to\n       clear old groups or just import the new ones. Feedback will be created\n       for each group, based on the template.\n\nSick of writing the same thing over and over again?\n    1. Open the Pasta Editor (Ctrl+G) and click \"New Pasta\"\n    2. Create and add tags to organize items by content and by assignment.\n    3. Close the window. The program will ask if you want to use the new pasta.\n\nQuick insert (Pasta) at caret\n    1. Select a Pasta item (the search function is your friend) and select a\n       position in a student file.\n    2. Press (Ctrl+Q) or right-click the pasta list. The pasta will be pasted\n       into the student feedback referencing the current file and position.\n       Some examples are included to let you try this out.\n\nWhen youre done, you can export everything as individual files using (Ctrl+E).\nYou can also double-click (or right click) a group in the list to get a preview.",
  "footer": "\nThis is the footer. This is a good place to include the signature tag.\nSimply including it in the body may cause issues with the automatic\ncreation of file tags. If the file tags are already present, its not an issue.\n\nThank you for using CopyPasta!\n%SIGNATURE%                                    \n\n\n  _______________________________\n /\\                              \\\n/++\\    __________________________\\\n\\+++\\   \\ ************************/\n \\+++\\   \\___________________ ***/\n  \\+++\\   \\             /+++/***/\n   \\+++\\   \\           /+++/***/\n    \\+++\\   \\         /+++/***/\n     \\+++\\   \\       /+++/***/\n      \\+++\\   \\     /+++/***/\n       \\+++\\   \\   /+++/***/\n        \\+++\\   \\ /+++/***/\n         \\+++\\   /+++/***/\n          \\+++\\ /+++/***/\n           \\+++++++/***/\n            \\+++++/***/\n             \\+++/***/\n              \\+/___/",
  "signature": "Richard Sundqvist (richard.sundqvist@live.se)",
  "group": "",
  "assignment": "",
  "grade": "",
  "done": false,
  "files": {},
  "possibleGrades": [
    "A+", "A", "A-",
    "B+", "B", "B-",
    "C+", "C", "C-",
    "D+", "D", "D-",
    "F"
  ]
}